// face_info.ts

export interface IdentityData {
  /**
   * 원본 특징값 (a)
   * Private Input. Circom 회로에서 실시간 카메라 값(ac)과 유사도를 비교하는 재료입니다.
   */
  features: number[]; // 10개의 정수화된 특징값 (Private 데이터)

  /**
   * 특징값의 해시 (ah)
   * 유저가 보관용으로 가집니다. (회로 내부에서 계산된 값과 대조 가능)
   */
  featureHash: string; // PoseidonHash(features) 결과값 (Leaf Node)
}

export interface MerkleProof {
  /**
   * 머클 루트 (mkr)
   * 현재 정부/통신사 시스템이 인정하는 최종 정답지입니다.
   */
  root: string; // 머클 트리 루트 해시

  /**
   * 형제 노드들
   * 핵심 재료. 내 해시(ah)부터 루트(mkr)까지 올라가는 계단입니다.
   * 층수(Height)만큼의 해시값이 들어있습니다.
   */
  pathElements: string[]; // 머클 경로 요소들

  /**
   * 경로 방향 (Index)
   * 해시를 합칠 때 내가 왼쪽(0)인지 오른쪽(1)인지 알려줍니다.
   * (예: Hash(나, 형제) 인지 Hash(형제, 나) 인지 결정)
   */
  pathIndices: number[]; // 머클 경로 인덱스들

  leafIndex: number; // 리프 노드 인덱스
  parentIndex: number; // 부모 노드 인덱스
}

export interface UserFaceData {
  userId: number; // 머클 트리의 리프 인덱스 (0, 1, 2...)
  userName: string; // 사용자 이름
  identityData: IdentityData; // 신원 데이터 (특징값 및 해시)
  merkleProof: MerkleProof; // 머클 트리 증명
}

export const governmentDB: UserFaceData[] = [
  {
    userId: 0,
    userName: "user_ceu",
    identityData: {
      features: [746, 5600, 8670, 3438, 4212, 4044, 9553, 16532, 14412, 1001],
      featureHash:
        "10094362218276815648174033054262866975703745050504857247488483499092523696968",
    },
    merkleProof: {
      root: "8662391002995205976173725801878326743554003431972821308754587705751578377426",
      pathElements: [
        "20815511153523823207154781022146335347095702261019487310073858894385064962002",
        "15433055328832757831854758567084967397746570709582141567901486238986499362232",
        "4068375456895390734650400322551717814611036070023143184053217667924498990711",
      ],
      pathIndices: [0, 0],
      leafIndex: 0,
      parentIndex: 0,
    },
  },
  {
    userId: 1,
    userName: "user_ltg",
    identityData: {
      features: [724, 5253, 8002, 3393, 4634, 3890, 9826, 14667, 12603, 833],
      featureHash:
        "20815511153523823207154781022146335347095702261019487310073858894385064962002",
    },
    merkleProof: {
      root: "8662391002995205976173725801878326743554003431972821308754587705751578377426",
      pathElements: [
        "10094362218276815648174033054262866975703745050504857247488483499092523696968",
        "15433055328832757831854758567084967397746570709582141567901486238986499362232",
        "4068375456895390734650400322551717814611036070023143184053217667924498990711",
      ],
      pathIndices: [1, 0],
      leafIndex: 1,
      parentIndex: 0,
    },
  },
  {
    userId: 2,
    userName: "user_kwy",
    identityData: {
      features: [714, 5448, 8341, 3134, 4399, 4200, 9755, 16333, 14571, 837],
      featureHash:
        "4870407073698415445165338990821730911139193919010562212357490217597554922807",
    },
    merkleProof: {
      root: "8662391002995205976173725801878326743554003431972821308754587705751578377426",
      pathElements: [
        "4360935217250007475419238659624694396767107993590452255060015091100801191847",
        "4068375456895390734650400322551717814611036070023143184053217667924498990711",
        "15433055328832757831854758567084967397746570709582141567901486238986499362232",
      ],
      pathIndices: [0, 1],
      leafIndex: 2,
      parentIndex: 1,
    },
  },
  {
    userId: 3,
    userName: "user_hyc",
    identityData: {
      features: [709, 4872, 8084, 3253, 4276, 4352, 9871, 16338, 14300, 880],
      featureHash:
        "4360935217250007475419238659624694396767107993590452255060015091100801191847",
    },
    merkleProof: {
      root: "8662391002995205976173725801878326743554003431972821308754587705751578377426",
      pathElements: [
        "4870407073698415445165338990821730911139193919010562212357490217597554922807",
        "4068375456895390734650400322551717814611036070023143184053217667924498990711",
        "15433055328832757831854758567084967397746570709582141567901486238986499362232",
      ],
      pathIndices: [1, 1],
      leafIndex: 3,
      parentIndex: 1,
    },
  },
];
